public class HomeWork {
    /*
        На закрепление по коллекциям! Можно использовать stream API !
        1)Пользователь вводит набор чисел в виде одной строки "1, 2, 3, 4, 4, 5".
         Избавиться от повторяющихся элементов в строке и вывести результат на экран.


        3) Создайте HashMap, содержащий пары значений - имя игрушки и объект игрушки (класс Toy).
        Перебрать и распечатать набор из имен игрушек (keySet).
        Перебрать и распечатать значения HashMap (values()).
        Перебрать пары значений(entrySet()). Для каждого перебора создать свой метод(параметризованный)
        4) Создать класс Товар, имеющий переменные имя, цена, рейтинг.
         Создать класс Категория, имеющий переменные имя и множество товаров.
         Создать несколько объектов класса Категория.
         Создать метод, распечатывающий товары каталога, отсортированные по имени, цене или рейтингу.
        Используем классы компараторы для каждого вида сортировки.
     */
}